iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
};

#define DBGMCU_1_0 (*(volatile struct DBGMCU_1_0_tag *) 0xe0042000)

struct QUADSPI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t ABORT:1;
      uint64_t DMAEN:1;
      uint64_t TCEN:1;
      uint64_t SSHIFT:1;
      uint64_t reservedSpace0:1;
      uint64_t DFM:1;
      uint64_t FSEL:1;
      uint64_t FTHRES:5;
      uint64_t reservedSpace1:3;
      uint64_t TEIE:1;
      uint64_t TCIE:1;
      uint64_t FTIE:1;
      uint64_t SMIE:1;
      uint64_t TOIE:1;
      uint64_t reservedSpace2:1;
      uint64_t APMS:1;
      uint64_t PMM:1;
      uint64_t PRESCALER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKMODE:1;
      uint64_t reservedSpace0:7;
      uint64_t CSHT:3;
      uint64_t reservedSpace1:5;
      uint64_t FSIZE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEF:1;
      uint64_t TCF:1;
      uint64_t FTF:1;
      uint64_t SMF:1;
      uint64_t TOF:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t FLEVEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTEF:1;
      uint64_t CTCF:1;
      uint64_t reservedSpace0:1;
      uint64_t CSMF:1;
      uint64_t CTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INSTRUCTION:8;
      uint64_t IMODE:2;
      uint64_t ADMODE:2;
      uint64_t ADSIZE:2;
      uint64_t ABMODE:2;
      uint64_t ABSIZE:2;
      uint64_t DCYC:5;
      uint64_t reservedSpace0:1;
      uint64_t DMODE:2;
      uint64_t FMODE:2;
      uint64_t SIOO:1;
      uint64_t reservedSpace1:1;
      uint64_t DHHC:1;
      uint64_t DDRM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRESS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALTERNATE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ABR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSMAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTERVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEOUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTR;

};

#define QUADSPI_1 (*(volatile struct QUADSPI_1_tag *) 0xa0001000)

struct RCC_1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSION:1;
      uint64_t MSIRDY:1;
      uint64_t MSIPLLEN:1;
      uint64_t MSIRGSEL:1;
      uint64_t MSIRANGE:4;
      uint64_t HSION:1;
      uint64_t HSIKERON:1;
      uint64_t HSIRDY:1;
      uint64_t HSIASFS:1;
      uint64_t reservedSpace0:4;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t CSSON:1;
      uint64_t reservedSpace1:4;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
      uint64_t PLLSAI1ON:1;
      uint64_t PLLSAI1RDY:1;
      uint64_t PLLSAI2ON:1;
      uint64_t PLLSAI2RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSICAL:8;
      uint64_t MSITRIM:8;
      uint64_t HSICAL:8;
      uint64_t HSITRIM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:2;
      uint64_t SWS:2;
      uint64_t HPRE:4;
      uint64_t PPRE1:3;
      uint64_t PPRE2:3;
      uint64_t reservedSpace0:1;
      uint64_t STOPWUCK:1;
      uint64_t reservedSpace1:8;
      uint64_t MCOSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t MCOPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLSRC:2;
      uint64_t reservedSpace0:2;
      uint64_t PLLM:3;
      uint64_t reservedSpace1:1;
      uint64_t PLLN:7;
      uint64_t reservedSpace2:1;
      uint64_t PLLPEN:1;
      uint64_t PLLP:1;
      uint64_t reservedSpace3:2;
      uint64_t PLLQEN:1;
      uint64_t PLLQ:2;
      uint64_t reservedSpace4:1;
      uint64_t PLLREN:1;
      uint64_t PLLR:2;
      uint64_t PLLPDIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PLLSAI1N:7;
      uint64_t reservedSpace1:1;
      uint64_t PLLSAI1PEN:1;
      uint64_t PLLSAI1P:1;
      uint64_t reservedSpace2:2;
      uint64_t PLLSAI1QEN:1;
      uint64_t PLLSAI1Q:2;
      uint64_t reservedSpace3:1;
      uint64_t PLLSAI1REN:1;
      uint64_t PLLSAI1R:2;
      uint64_t PLLSAI1PDIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSAI1CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PLLSAI2N:7;
      uint64_t reservedSpace1:1;
      uint64_t PLLSAI2PEN:1;
      uint64_t PLLSAI2P:1;
      uint64_t reservedSpace2:6;
      uint64_t PLLSAI2REN:1;
      uint64_t PLLSAI2R:2;
      uint64_t PLLSAI2PDIV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSAI2CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t MSIRDYIE:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLRDYIE:1;
      uint64_t PLLSAI1RDYIE:1;
      uint64_t PLLSAI2RDYIE:1;
      uint64_t reservedSpace0:1;
      uint64_t LSECSSIE:1;
      uint64_t HSI48RDYIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t MSIRDYF:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLRDYF:1;
      uint64_t PLLSAI1RDYF:1;
      uint64_t PLLSAI2RDYF:1;
      uint64_t CSSF:1;
      uint64_t LSECSSF:1;
      uint64_t HSI48RDYF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t MSIRDYC:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLRDYC:1;
      uint64_t PLLSAI1RDYC:1;
      uint64_t PLLSAI2RDYC:1;
      uint64_t CSSC:1;
      uint64_t LSECSSC:1;
      uint64_t HSI48RDYC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CICR;

