iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
};

#define RCC_2 (*(volatile struct RCC_2_tag *) 0x40023800)

struct RI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IC1IOS:4;
      uint64_t IC2IOS:4;
      uint64_t IC3IOS:4;
      uint64_t IC4IOS:4;
      uint64_t TIM:2;
      uint64_t IC1:1;
      uint64_t IC2:1;
      uint64_t IC3:1;
      uint64_t IC4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0GR1_1:1;
      uint64_t CH1GR1_2:1;
      uint64_t CH2GR1_3:1;
      uint64_t CH3GR1_4:1;
      uint64_t CH31GR11_5:1;
      uint64_t COMP1_SW1:1;
      uint64_t CH6GR2_1:1;
      uint64_t CH7GR2_2:1;
      uint64_t CH8GR3_1:1;
      uint64_t CH9GR3_2:1;
      uint64_t CH10GR8_1:1;
      uint64_t CH11GR8_2:1;
      uint64_t CH12GR8_3:1;
      uint64_t CH13GR8_4:1;
      uint64_t CH14GR9_1:1;
      uint64_t CH15GR9_2:1;
      uint64_t CH31GR7_1:1;
      uint64_t reservedSpace0:1;
      uint64_t CH18GR7_1:1;
      uint64_t CH19GR7_2:1;
      uint64_t CH20GR7_3:1;
      uint64_t CH21GR7_4:1;
      uint64_t CH22:1;
      uint64_t CH23:1;
      uint64_t CH24:1;
      uint64_t CH25:1;
      uint64_t VCOMP:1;
      uint64_t CH27GR11_1:1;
      uint64_t CH28GR11_2:1;
      uint64_t CH29GR11_3:1;
      uint64_t CH30GR11_4:1;
      uint64_t SCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GR10_1:1;
      uint64_t GR10_2:1;
      uint64_t GR10_3:1;
      uint64_t GR10_4:1;
      uint64_t GR6_1:1;
      uint64_t GR6_2:1;
      uint64_t GR5_1:1;
      uint64_t GR5_2:1;
      uint64_t GR5_3:1;
      uint64_t GR4_1:1;
      uint64_t GR4_2:1;
      uint64_t GR4_3:1;
      uint64_t reservedSpace0:4;
      uint64_t GR3_3:1;
      uint64_t GR3_4:1;
      uint64_t GR3_5:1;
      uint64_t GR9_3:1;
      uint64_t GR9_4:1;
      uint64_t GR2_3:1;
      uint64_t GR2_4:1;
      uint64_t GR2_5:1;
      uint64_t GR7_5:1;
      uint64_t GR7_6:1;
      uint64_t GR7_7:1;
      uint64_t GR6_3:1;
      uint64_t GR6_4:1;
      uint64_t GR5_4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ASCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA:16;
      uint64_t PB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HYSCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:16;
      uint64_t PD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HYSCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:16;
      uint64_t PF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HYSCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PG:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HYSCR4;

};

#define RI_0 (*(volatile struct RI_0_tag *) 0x40007c08)

struct RTC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SU:4;
      uint64_t ST:3;
      uint64_t reservedSpace0:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t reservedSpace1:1;
      uint64_t HU:4;
      uint64_t HT:2;
      uint64_t PM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DU:4;
      uint64_t DT:2;
      uint64_t reservedSpace0:2;
      uint64_t MU:4;
      uint64_t MT:1;
      uint64_t WDU:3;
      uint64_t YU:4;
      uint64_t YT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WCKSEL:3;
      uint64_t TSEDGE:1;
      uint64_t REFCKON:1;
      uint64_t BYPSHAD:1;
      uint64_t FMT:1;
      uint64_t DCE:1;
      uint64_t ALRAE:1;
      uint64_t ALRBE:1;
      uint64_t WUTE:1;
      uint64_t TSE:1;
      uint64_t ALRAIE:1;
      uint64_t ALRBIE:1;
      uint64_t WUTIE:1;
      uint64_t TSIE:1;
      uint64_t ADD1H:1;
      uint64_t SUB1H:1;
      uint64_t BKP:1;
      uint64_t COSEL:1;
      uint64_t POL:1;
      uint64_t OSEL:2;
      uint64_t COE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALRAWF:1;
      uint64_t ALRBWF:1;
      uint64_t WUTWF:1;
      uint64_t SHPF:1;
      uint64_t INITS:1;
      uint64_t RSF:1;
      uint64_t INITF:1;
      uint64_t INIT:1;
      uint64_t ALRAF:1;
      uint64_t ALRBF:1;
      uint64_t WUTF:1;
      uint64_t TSF:1;
      uint64_t TSOVF:1;
      uint64_t TAMP1F:1;
      uint64_t TAMP2F:1;
      uint64_t TAMP3F:1;
      uint64_t RECALPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREDIV_S:15;
      uint64_t reservedSpace0:1;
      uint64_t PREDIV_A:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DC:5;
      uint64_t reservedSpace0:2;
      uint64_t DCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALIBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SU:4;
      uint64_t ST:3;
      uint64_t MSK1:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t MSK2:1;
      uint64_t HU:4;
      uint64_t HT:2;
      uint64_t PM:1;
      uint64_t MSK3:1;
      uint64_t DU:4;
      uint64_t DT:2;
      uint64_t WDSEL:1;
      uint64_t MSK4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRMAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SU:4;
      uint64_t ST:3;
      uint64_t MSK1:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t MSK2:1;
      uint64_t HU:4;
      uint64_t HT:2;
      uint64_t PM:1;
      uint64_t MSK3:1;
      uint64_t DU:4;
      uint64_t DT:2;
      uint64_t WDSEL:1;
      uint64_t MSK4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRMBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUBFS:15;
      uint64_t reservedSpace0:16;
      uint64_t ADD1S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SU:4;
      uint64_t ST:3;
      uint64_t reservedSpace0:1;
      uint64_t MNU:4;
      uint64_t MNT:3;
      uint64_t reservedSpace1:1;
      uint64_t HU:4;
      uint64_t HT:2;
      uint64_t PM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DU:4;
      uint64_t DT:2;
      uint64_t reservedSpace0:2;
      uint64_t MU:4;
      uint64_t MT:1;
      uint64_t WDU:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALM:9;
      uint64_t reservedSpace0:4;
      uint64_t CALW16:1;
      uint64_t CALW8:1;
      uint64_t CALP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMP1E:1;
      uint64_t TAMP1ETRG:1;
      uint64_t TAMPIE:1;
      uint64_t TAMP2E:1;
      uint64_t TAMP2TRG:1;
      uint64_t TAMP3E:1;
      uint64_t TAMP3TRG:1;
      uint64_t TAMPTS:1;
      uint64_t TAMPFREQ:3;
      uint64_t TAMPFLT:2;
      uint64_t TAMPPRCH:2;
      uint64_t TAMPPUDIS:1;
      uint64_t reservedSpace0:2;
      uint64_t ALARMOUTTYPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS:15;
      uint64_t reservedSpace0:9;
      uint64_t MASKSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRMASSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS:15;
      uint64_t reservedSpace0:9;
      uint64_t MASKSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRMBSSR;

