iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
};

#define I2C1_1_1 (*(volatile struct I2C1_1_1_tag *) 0x40005400)

struct I2C2_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t SMBUS:1;
      uint64_t reservedSpace0:1;
      uint64_t SMBTYPE:1;
      uint64_t ENARP:1;
      uint64_t ENPEC:1;
      uint64_t ENGC:1;
      uint64_t NOSTRETCH:1;
      uint64_t START:1;
      uint64_t STOP:1;
      uint64_t ACK:1;
      uint64_t POS:1;
      uint64_t PEC:1;
      uint64_t ALERT:1;
      uint64_t reservedSpace1:1;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:6;
      uint64_t reservedSpace0:2;
      uint64_t ITERREN:1;
      uint64_t ITEVTEN:1;
      uint64_t ITBUFEN:1;
      uint64_t DMAEN:1;
      uint64_t LAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADD_0:1;
      uint64_t ADD_1_7:7;
      uint64_t ADD_8_9:2;
      uint64_t reservedSpace0:5;
      uint64_t ADDMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENDUAL:1;
      uint64_t ADD2:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SB:1;
      uint64_t ADDR:1;
      uint64_t BTF:1;
      uint64_t ADD10:1;
      uint64_t STOPF:1;
      uint64_t reservedSpace0:1;
      uint64_t RxNE:1;
      uint64_t TxE:1;
      uint64_t BERR:1;
      uint64_t ARLO:1;
      uint64_t AF:1;
      uint64_t OVR:1;
      uint64_t PECERR:1;
      uint64_t reservedSpace1:1;
      uint64_t TIMEOUT:1;
      uint64_t SMBALERT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSL:1;
      uint64_t BUSY:1;
      uint64_t TRA:1;
      uint64_t reservedSpace0:1;
      uint64_t GENCALL:1;
      uint64_t SMBDEFAULT:1;
      uint64_t SMBHOST:1;
      uint64_t DUALF:1;
      uint64_t PEC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCR:12;
      uint64_t reservedSpace0:2;
      uint64_t DUTY:1;
      uint64_t F_S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRISE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRISE;

};

#define I2C2_1_1 (*(volatile struct I2C2_1_1_tag *) 0x40005800)

struct IWDG_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVU:1;
      uint64_t RVU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

};

#define IWDG_1_1 (*(volatile struct IWDG_1_1_tag *) 0x40003000)

struct OPAMP_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPA1PD:1;
      uint64_t S3SEL1:1;
      uint64_t S4SEL1:1;
      uint64_t S5SEL1:1;
      uint64_t S6SEL1:1;
      uint64_t OPA1CAL_L:1;
      uint64_t OPA1CAL_H:1;
      uint64_t OPA1LPM:1;
      uint64_t OPA2PD:1;
      uint64_t S3SEL2:1;
      uint64_t S4SEL2:1;
      uint64_t S5SEL2:1;
      uint64_t S6SEL2:1;
      uint64_t OPA2CAL_L:1;
      uint64_t OPA2CAL_H:1;
      uint64_t OPA2LPM:1;
      uint64_t OPA3PD:1;
      uint64_t S3SEL3:1;
      uint64_t S4SEL3:1;
      uint64_t S5SEL3:1;
      uint64_t S6SEL3:1;
      uint64_t OPA3CAL_L:1;
      uint64_t OPA3CAL_H:1;
      uint64_t OPA3LPM:1;
      uint64_t ANAWSEL1:1;
      uint64_t ANAWSEL2:1;
      uint64_t ANAWSEL3:1;
      uint64_t S7SEL2:1;
      uint64_t AOP_RANGE:1;
      uint64_t OPA1CALOUT:1;
      uint64_t OPA2CALOUT:1;
      uint64_t OPA3CALOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AO1_OPT_OFFSET_TRIM:10;
      uint64_t AO2_OPT_OFFSET_TRIM:10;
      uint64_t AO3_OPT_OFFSET_TRIM:10;
      uint64_t reservedSpace0:1;
      uint64_t OT_USER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AO1_OPT_OFFSET_TRIM_LP:10;
      uint64_t AO2_OPT_OFFSET_TRIM_LP:10;
      uint64_t AO3_OPT_OFFSET_TRIM_LP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPOTR;

};

#define OPAMP_1_1 (*(volatile struct OPAMP_1_1_tag *) 0x40007c5c)

struct PWR_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPSDSR:1;
      uint64_t PDDS:1;
      uint64_t CWUF:1;
      uint64_t CSBF:1;
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t DBP:1;
      uint64_t ULP:1;
      uint64_t FWU:1;
      uint64_t VOS:2;
      uint64_t reservedSpace0:1;
      uint64_t LPRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUF:1;
      uint64_t SBF:1;
      uint64_t PVDO:1;
      uint64_t VREFINTRDYF:1;
      uint64_t VOSF:1;
      uint64_t REGLPF:1;
      uint64_t reservedSpace0:2;
      uint64_t EWUP1:1;
      uint64_t EWUP2:1;
      uint64_t EWUP3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

};

#define PWR_1_1 (*(volatile struct PWR_1_1_tag *) 0x40007000)

struct RCC_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSION:1;
      uint64_t HSIRDY:1;
      uint64_t reservedSpace0:6;
      uint64_t MSION:1;
      uint64_t MSIRDY:1;
      uint64_t reservedSpace1:6;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t reservedSpace2:5;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
      uint64_t reservedSpace3:2;
      uint64_t CSSON:1;
      uint64_t RTCPRE0:1;
      uint64_t RTCPRE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSICAL:8;
      uint64_t HSITRIM:5;
      uint64_t MSIRANGE:3;
      uint64_t MSICAL:8;
      uint64_t MSITRIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:2;
      uint64_t SWS:2;
      uint64_t HPRE:4;
      uint64_t PPRE1:3;
      uint64_t PPRE2:3;
      uint64_t reservedSpace0:2;
      uint64_t PLLSRC:1;
      uint64_t reservedSpace1:1;
      uint64_t PLLMUL:4;
      uint64_t PLLDIV:2;
      uint64_t MCOSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t MCOPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLRDYF:1;
      uint64_t MSIRDYF:1;
      uint64_t reservedSpace0:1;
      uint64_t CSSF:1;
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLRDYIE:1;
      uint64_t MSIRDYIE:1;
      uint64_t LSECSSIE:1;
      uint64_t reservedSpace1:1;
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLRDYC:1;
      uint64_t MSIRDYC:1;
      uint64_t LSECSSC:1;
      uint64_t CSSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOARST:1;
      uint64_t GPIOBRST:1;
      uint64_t GPIOCRST:1;
      uint64_t GPIODRST:1;
      uint64_t GPIOERST:1;
      uint64_t GPIOHRST:1;
      uint64_t GPIOFRST:1;
      uint64_t GPIOGRST:1;
      uint64_t reservedSpace0:4;
      uint64_t CRCRST:1;
      uint64_t reservedSpace1:2;
      uint64_t FLITFRST:1;
      uint64_t reservedSpace2:8;
      uint64_t DMA1RST:1;
      uint64_t DMA2RST:1;
      uint64_t reservedSpace3:4;
      uint64_t FSMCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM9RST:1;
      uint64_t TM10RST:1;
      uint64_t TM11RST:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC1RST:1;
      uint64_t reservedSpace2:1;
      uint64_t SDIORST:1;
      uint64_t SPI1RST:1;
      uint64_t reservedSpace3:1;
      uint64_t USART1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t TIM4RST:1;
      uint64_t TIM5RST:1;
      uint64_t TIM6RST:1;
      uint64_t TIM7RST:1;
      uint64_t reservedSpace0:3;
      uint64_t LCDRST:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDRST:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI2RST:1;
      uint64_t SPI3RST:1;
      uint64_t reservedSpace3:1;
      uint64_t USART2RST:1;
      uint64_t USART3RST:1;
      uint64_t UART4RST:1;
      uint64_t UART5RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t USBRST:1;
      uint64_t reservedSpace4:4;
      uint64_t PWRRST:1;
      uint64_t DACRST:1;
      uint64_t reservedSpace5:1;
      uint64_t COMPRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOPAEN:1;
      uint64_t GPIOPBEN:1;
      uint64_t GPIOPCEN:1;
      uint64_t GPIOPDEN:1;
      uint64_t GPIOPEEN:1;
      uint64_t GPIOPHEN:1;
      uint64_t GPIOPFEN:1;
      uint64_t GPIOPGEN:1;
      uint64_t reservedSpace0:4;
      uint64_t CRCEN:1;
      uint64_t reservedSpace1:2;
      uint64_t FLITFEN:1;
      uint64_t reservedSpace2:8;
      uint64_t DMA1EN:1;
      uint64_t DMA2EN:1;
      uint64_t reservedSpace3:4;
      uint64_t FSMCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM9EN:1;
      uint64_t TIM10EN:1;
      uint64_t TIM11EN:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC1EN:1;
      uint64_t reservedSpace2:1;
      uint64_t SDIOEN:1;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace3:1;
      uint64_t USART1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t TIM4EN:1;
      uint64_t TIM5EN:1;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t reservedSpace0:3;
      uint64_t LCDEN:1;
      uint64_t reservedSpace1:1;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI2EN:1;
      uint64_t SPI3EN:1;
      uint64_t reservedSpace3:1;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t USART4EN:1;
      uint64_t USART5EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t USBEN:1;
      uint64_t reservedSpace4:4;
      uint64_t PWREN:1;
      uint64_t DACEN:1;
      uint64_t reservedSpace5:1;
      uint64_t COMPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPIOALPEN:1;
      uint64_t GPIOBLPEN:1;
      uint64_t GPIOCLPEN:1;
      uint64_t GPIODLPEN:1;
      uint64_t GPIOELPEN:1;
      uint64_t GPIOHLPEN:1;
      uint64_t GPIOFLPEN:1;
      uint64_t GPIOGLPEN:1;
      uint64_t reservedSpace0:4;
      uint64_t CRCLPEN:1;
      uint64_t reservedSpace1:2;
      uint64_t FLITFLPEN:1;
      uint64_t SRAMLPEN:1;
      uint64_t reservedSpace2:7;
      uint64_t DMA1LPEN:1;
      uint64_t DMA2LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBLPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGLPEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM9LPEN:1;
      uint64_t TIM10LPEN:1;
      uint64_t TIM11LPEN:1;
      uint64_t reservedSpace1:4;
      uint64_t ADC1LPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t SDIOLPEN:1;
      uint64_t SPI1LPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t USART1LPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2LPEN:1;
      uint64_t TIM3LPEN:1;
      uint64_t TIM4LPEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM6LPEN:1;
      uint64_t TIM7LPEN:1;
      uint64_t reservedSpace1:3;
      uint64_t LCDLPEN:1;
      uint64_t reservedSpace2:1;
      uint64_t WWDGLPEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI2LPEN:1;
      uint64_t reservedSpace4:2;
      uint64_t USART2LPEN:1;
      uint64_t USART3LPEN:1;
      uint64_t reservedSpace5:2;
      uint64_t I2C1LPEN:1;
      uint64_t I2C2LPEN:1;
      uint64_t USBLPEN:1;
      uint64_t reservedSpace6:4;
      uint64_t PWRLPEN:1;
      uint64_t DACLPEN:1;
      uint64_t reservedSpace7:1;
      uint64_t COMPLPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1LPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSION:1;
      uint64_t LSIRDY:1;
      uint64_t reservedSpace0:6;
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t LSECSSON:1;
      uint64_t LSECSSD:1;
      uint64_t reservedSpace1:3;
      uint64_t RTCSEL:2;
      uint64_t reservedSpace2:4;
      uint64_t RTCEN:1;
      uint64_t RTCRST:1;
      uint64_t RMVF:1;
      uint64_t OBLRSTF:1;
      uint64_t PINRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t IWDGRSTF:1;
      uint64_t WWDGRSTF:1;
      uint64_t LPWRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

