iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
};

#define GPIO_PIN_INT_0 (*(volatile struct GPIO_PIN_INT_0_tag *) 0x4004c000)

struct SSP1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS:4;
      uint64_t FRF:2;
      uint64_t CPOL:1;
      uint64_t CPHA:1;
      uint64_t SCR:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBM:1;
      uint64_t SSE:1;
      uint64_t MS:1;
      uint64_t SOD:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFE:1;
      uint64_t TNF:1;
      uint64_t RNE:1;
      uint64_t RFF:1;
      uint64_t BSY:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPSDVSR:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIM:1;
      uint64_t RTIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORRIS:1;
      uint64_t RTRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORMIS:1;
      uint64_t RTMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIC:1;
      uint64_t RTIC:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

};

#define SSP1_0 (*(volatile struct SSP1_0_tag *) 0x40058000)

struct GPIO_GROUP_INT0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:1;
      uint64_t COMB:1;
      uint64_t TRIG:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POL_0:1;
      uint64_t POL_1:1;
      uint64_t POL_2:1;
      uint64_t POL_3:1;
      uint64_t POL_4:1;
      uint64_t POL_5:1;
      uint64_t POL_6:1;
      uint64_t POL_7:1;
      uint64_t POL_8:1;
      uint64_t POL_9:1;
      uint64_t POL_10:1;
      uint64_t POL_11:1;
      uint64_t POL_12:1;
      uint64_t POL_13:1;
      uint64_t POL_14:1;
      uint64_t POL_15:1;
      uint64_t POL_16:1;
      uint64_t POL_17:1;
      uint64_t POL_18:1;
      uint64_t POL_19:1;
      uint64_t POL_20:1;
      uint64_t POL_21:1;
      uint64_t POL_22:1;
      uint64_t POL_23:1;
      uint64_t POL_24:1;
      uint64_t POL_25:1;
      uint64_t POL_26:1;
      uint64_t POL_27:1;
      uint64_t POL_28:1;
      uint64_t POL_29:1;
      uint64_t POL_30:1;
      uint64_t POL_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_POL1;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA_0:1;
      uint64_t ENA_1:1;
      uint64_t ENA_2:1;
      uint64_t ENA_3:1;
      uint64_t ENA_4:1;
      uint64_t ENA_5:1;
      uint64_t ENA_6:1;
      uint64_t ENA_7:1;
      uint64_t ENA_8:1;
      uint64_t ENA_9:1;
      uint64_t ENA_10:1;
      uint64_t ENA_11:1;
      uint64_t ENA_12:1;
      uint64_t ENA_13:1;
      uint64_t ENA_14:1;
      uint64_t ENA_15:1;
      uint64_t ENA_16:1;
      uint64_t ENA_17:1;
      uint64_t ENA_18:1;
      uint64_t ENA_19:1;
      uint64_t ENA_20:1;
      uint64_t ENA_21:1;
      uint64_t ENA_22:1;
      uint64_t ENA_23:1;
      uint64_t ENA_24:1;
      uint64_t ENA_25:1;
      uint64_t ENA_26:1;
      uint64_t ENA_27:1;
      uint64_t ENA_28:1;
      uint64_t ENA_29:1;
      uint64_t ENA_30:1;
      uint64_t ENA_31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_ENA1;

