iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
  uint8_t res6[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRP00:1;
      uint64_t CLRP01:1;
      uint64_t CLRP02:1;
      uint64_t CLRP03:1;
      uint64_t CLRP04:1;
      uint64_t CLRP05:1;
      uint64_t CLRP06:1;
      uint64_t CLRP07:1;
      uint64_t CLRP08:1;
      uint64_t CLRP09:1;
      uint64_t CLRP010:1;
      uint64_t CLRP011:1;
      uint64_t CLRP012:1;
      uint64_t CLRP013:1;
      uint64_t CLRP014:1;
      uint64_t CLRP015:1;
      uint64_t CLRP016:1;
      uint64_t CLRP017:1;
      uint64_t CLRP018:1;
      uint64_t CLRP019:1;
      uint64_t CLRP020:1;
      uint64_t CLRP021:1;
      uint64_t CLRP022:1;
      uint64_t CLRP023:1;
      uint64_t CLRP024:1;
      uint64_t CLRP025:1;
      uint64_t CLRP026:1;
      uint64_t CLRP027:1;
      uint64_t CLRP028:1;
      uint64_t CLRP029:1;
      uint64_t CLRP030:1;
      uint64_t CLRP031:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLR1;

  uint8_t res7[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NOTP0:1;
      uint64_t NOTP1:1;
      uint64_t NOTP2:1;
      uint64_t NOTP3:1;
      uint64_t NOTP4:1;
      uint64_t NOTP5:1;
      uint64_t NOTP6:1;
      uint64_t NOTP7:1;
      uint64_t NOTP8:1;
      uint64_t NOTP9:1;
      uint64_t NOTP10:1;
      uint64_t NOTP11:1;
      uint64_t NOTP12:1;
      uint64_t NOTP13:1;
      uint64_t NOTP14:1;
      uint64_t NOTP15:1;
      uint64_t NOTP16:1;
      uint64_t NOTP17:1;
      uint64_t NOTP18:1;
      uint64_t NOTP19:1;
      uint64_t NOTP20:1;
      uint64_t NOTP21:1;
      uint64_t NOTP22:1;
      uint64_t NOTP23:1;
      uint64_t NOTP24:1;
      uint64_t NOTP25:1;
      uint64_t NOTP26:1;
      uint64_t NOTP27:1;
      uint64_t NOTP28:1;
      uint64_t NOTP29:1;
      uint64_t NOTP30:1;
      uint64_t NOTP31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NOT1;

};

#define GPIO_PORT_0 (*(volatile struct GPIO_PORT_0_tag *) 0x50000000)

struct System_Control_Space_System_Control_Block_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VARIANT:4;
      uint64_t PARTNO:12;
      uint64_t reservedSpace0:4;
      uint64_t REVISION:4;
      uint64_t IMPLEMENTER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTACTIVE:8;
      uint64_t reservedSpace0:3;
      uint64_t RETTOBASE:1;
      uint64_t VECTPENDING:10;
      uint64_t ISRPENDING:1;
      uint64_t ISRPREEMPT:1;
      uint64_t reservedSpace1:1;
      uint64_t PENDSTCLR:1;
      uint64_t PENDSTSET:1;
      uint64_t PENDSVCLR:1;
      uint64_t PENDSVSET:1;
      uint64_t reservedSpace2:2;
      uint64_t NMIPENDSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t TBLOFF:22;
      uint64_t TBLBASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTRESET:1;
      uint64_t VECTCLRACTIVE:1;
      uint64_t SYSRESETREQ:1;
      uint64_t reservedSpace0:5;
      uint64_t PRIGROUP:3;
      uint64_t reservedSpace1:4;
      uint64_t ENDIANESS:1;
      uint64_t VECTKEYVECTKEYSTAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLEEPONEXIT:1;
      uint64_t SLEEPDEEP:1;
      uint64_t reservedSpace1:1;
      uint64_t SEVONPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NONEBASETHRDENA:1;
      uint64_t USERSETMPEND:1;
      uint64_t reservedSpace0:1;
      uint64_t UNALIGN_TRP:1;
      uint64_t DIV_0_TRP:1;
      uint64_t reservedSpace1:3;
      uint64_t BFHFNMIGN:1;
      uint64_t STKALIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_4:8;
      uint64_t PRI_5:8;
      uint64_t PRI_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMFAULTACT:1;
      uint64_t BUSFAULTACT:1;
      uint64_t reservedSpace0:1;
      uint64_t USGFAULTACT:1;
      uint64_t reservedSpace1:3;
      uint64_t SVCALLACT:1;
      uint64_t MONITORACT:1;
      uint64_t reservedSpace2:1;
      uint64_t PENDSVACT:1;
      uint64_t SYSTICKACT:1;
      uint64_t USGFAULTPENDED:1;
      uint64_t MEMFAULTPENDED:1;
      uint64_t BUSFAULTPENDED:1;
      uint64_t SVCALLPENDED:1;
      uint64_t MEMFAULTENA:1;
      uint64_t BUSFAULTENA:1;
      uint64_t USGFAULTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHCRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IACCVIOL:1;
      uint64_t DACCVIOL:1;
      uint64_t reservedSpace0:1;
      uint64_t MUNSTKERR:1;
      uint64_t MSTKERR:1;
      uint64_t reservedSpace1:2;
      uint64_t MMARVALID:1;
      uint64_t IBUSERR:1;
      uint64_t PRECISERR:1;
      uint64_t IMPRECISERR:1;
      uint64_t UNSTKERR:1;
      uint64_t STKERR:1;
      uint64_t reservedSpace2:2;
      uint64_t BFARVALID:1;
      uint64_t UNDEFINSTR:1;
      uint64_t INVSTATE:1;
      uint64_t INVPC:1;
      uint64_t NOCP:1;
      uint64_t reservedSpace3:4;
      uint64_t UNALIGNED:1;
      uint64_t DIVBYZERO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t VECTTBL:1;
      uint64_t reservedSpace1:28;
      uint64_t FORCED:1;
      uint64_t DEBUGEVT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALTED:1;
      uint64_t BKPT:1;
      uint64_t DWTTRAP:1;
      uint64_t VCATCH:1;
      uint64_t EXTERNAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSR;

  uint32_t MMFAR;
  uint32_t BFAR;
  uint32_t AFSR;
  uint32_t PFR0;
  uint32_t PFR1;
  uint32_t DFR0;
  uint32_t AFR0;
  uint32_t MMFR0;
  uint32_t MMFR1;
  uint32_t MMFR2;
  uint32_t MMFR3;
  uint32_t ISAR0;
  uint32_t ISAR1;
  uint32_t ISAR2;
  uint32_t ISAR3;
  uint32_t ISAR4;
  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0:2;
      uint64_t CP1:2;
      uint64_t CP2:2;
      uint64_t CP3:2;
      uint64_t CP4:2;
      uint64_t CP5:2;
      uint64_t CP6:2;
      uint64_t CP7:2;
      uint64_t reservedSpace0:4;
      uint64_t CP10:2;
      uint64_t CP11:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPACR;

