iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MMFAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMFAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BFAR;

};

#define SCB_1 (*(volatile struct SCB_1_tag *) 0xe000ed00)

struct STK_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALIB;

};

#define STK_1 (*(volatile struct STK_1_tag *) 0xe000e010)

struct I2C_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t AA:1;
      uint64_t SI:1;
      uint64_t STO:1;
      uint64_t STA:1;
      uint64_t I2EN:1;
      uint64_t RESERVED_1:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:3;
      uint64_t Status:5;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCLL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t AAC:1;
      uint64_t SIC:1;
      uint64_t RESERVED_1:1;
      uint64_t STAC:1;
      uint64_t I2ENC:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MM_ENA:1;
      uint64_t ENA_SCL:1;
      uint64_t MATCH_ALL:1;
      uint64_t RESERVED:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GC:1;
      uint64_t Address:7;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_BUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:1;
      uint64_t MASK:7;
      uint64_t RESERVED_1:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASK3;

};

#define I2C_1 (*(volatile struct I2C_1_tag *) 0x40000000)

struct WWDT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDEN:1;
      uint64_t WDRESET:1;
      uint64_t WDTOF:1;
      uint64_t WDINT:1;
      uint64_t WDPROTECT:1;
      uint64_t LOCK:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEED:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSEL:1;
      uint64_t RESERVED:30;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WARNINT:10;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WARNINT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINDOW:24;
      uint64_t RESERVED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WINDOW;

};

#define WWDT_1 (*(volatile struct WWDT_1_tag *) 0x40004000)

struct CT16B0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0INT:1;
      uint64_t MR1INT:1;
      uint64_t MR2INT:1;
      uint64_t MR3INT:1;
      uint64_t CR0INT:1;
      uint64_t RESERVED_0:1;
      uint64_t CR1INT:1;
      uint64_t RESERVED_1:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t CRST:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCVAL:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0I:1;
      uint64_t MR0R:1;
      uint64_t MR0S:1;
      uint64_t MR1I:1;
      uint64_t MR1R:1;
      uint64_t MR1S:1;
      uint64_t MR2I:1;
      uint64_t MR2R:1;
      uint64_t MR2S:1;
      uint64_t MR3I:1;
      uint64_t MR3R:1;
      uint64_t MR3S:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP0RE:1;
      uint64_t CAP0FE:1;
      uint64_t CAP0I:1;
      uint64_t RESERVED_0:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t CAP1RE:1;
      uint64_t CAP1FE:1;
      uint64_t CAP1I:1;
      uint64_t RESERVED_3:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAP:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

