iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
  uint8_t res15[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LATENCY:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQLATENCY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQNO:5;
      uint64_t RESERVED:26;
      uint64_t NMIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMISRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTPIN:5;
      uint64_t PORTSEL:1;
      uint64_t RESERVED:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINTSEL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AP_CLK:1;
      uint64_t POL_CLK:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEED_CLKST:1;
      uint64_t RESERVED:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKST;

  uint8_t res16[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINT0:1;
      uint64_t PINT1:1;
      uint64_t PINT2:1;
      uint64_t PINT3:1;
      uint64_t PINT4:1;
      uint64_t PINT5:1;
      uint64_t PINT6:1;
      uint64_t PINT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERP0;

  uint8_t res17[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t WWDTINT:1;
      uint64_t BODINT:1;
      uint64_t RESERVED:5;
      uint64_t USB_WAKEUP:1;
      uint64_t GPIOINT0:1;
      uint64_t GPIOINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STARTERP1;

  uint8_t res18[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t BOD_PD:1;
      uint64_t reservedSpace1:2;
      uint64_t WDTOSC_PD:1;
      uint64_t RESERVED:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSLEEPCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRCOUT_PD:1;
      uint64_t IRC_PD:1;
      uint64_t FLASH_PD:1;
      uint64_t BOD_PD:1;
      uint64_t ADC_PD:1;
      uint64_t SYSOSC_PD:1;
      uint64_t WDTOSC_PD:1;
      uint64_t SYSPLL_PD:1;
      uint64_t USBPLL_PD:1;
      uint64_t RESERVED_0:1;
      uint64_t USBPAD_PD:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDAWAKECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRCOUT_PD:1;
      uint64_t IRC_PD:1;
      uint64_t FLASH_PD:1;
      uint64_t BOD_PD:1;
      uint64_t ADC_PD:1;
      uint64_t SYSOSC_PD:1;
      uint64_t WDTOSC_PD:1;
      uint64_t SYSPLL_PD:1;
      uint64_t USBPLL_PD:1;
      uint64_t RESERVED_0:1;
      uint64_t USBPAD_PD:1;
      uint64_t RESERVED_1:1;
      uint64_t RESERVED_2:1;
      uint64_t RESERVED_3:3;
      uint64_t RESERVED_4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDRUNCFG;

  uint8_t res19[444];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICEID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEVICE_ID;

};

#define SYSCON_1 (*(volatile struct SYSCON_1_tag *) 0x40048000)

struct GPIO_PIN_INT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE0:1;
      uint64_t PMODE1:1;
      uint64_t PMODE2:1;
      uint64_t PMODE3:1;
      uint64_t PMODE4:1;
      uint64_t PMODE5:1;
      uint64_t PMODE6:1;
      uint64_t PMODE7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENRL0:1;
      uint64_t ENRL1:1;
      uint64_t ENRL2:1;
      uint64_t ENRL3:1;
      uint64_t ENRL4:1;
      uint64_t ENRL5:1;
      uint64_t ENRL6:1;
      uint64_t ENRL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENRL0:1;
      uint64_t SETENRL1:1;
      uint64_t SETENRL2:1;
      uint64_t SETENRL3:1;
      uint64_t SETENRL4:1;
      uint64_t SETENRL5:1;
      uint64_t SETENRL6:1;
      uint64_t SETENRL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENRL0:1;
      uint64_t CENRL1:1;
      uint64_t CENRL2:1;
      uint64_t CENRL3:1;
      uint64_t CENRL4:1;
      uint64_t CENRL5:1;
      uint64_t CENRL6:1;
      uint64_t CENRL7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENAF0:1;
      uint64_t ENAF1:1;
      uint64_t ENAF2:1;
      uint64_t ENAF3:1;
      uint64_t ENAF4:1;
      uint64_t ENAF5:1;
      uint64_t ENAF6:1;
      uint64_t ENAF7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENAF0:1;
      uint64_t SETENAF1:1;
      uint64_t SETENAF2:1;
      uint64_t SETENAF3:1;
      uint64_t SETENAF4:1;
      uint64_t SETENAF5:1;
      uint64_t SETENAF6:1;
      uint64_t SETENAF7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENAF0:1;
      uint64_t CENAF1:1;
      uint64_t CENAF2:1;
      uint64_t CENAF3:1;
      uint64_t CENAF4:1;
      uint64_t CENAF5:1;
      uint64_t CENAF6:1;
      uint64_t CENAF7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIENF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDET0:1;
      uint64_t RDET1:1;
      uint64_t RDET2:1;
      uint64_t RDET3:1;
      uint64_t RDET4:1;
      uint64_t RDET5:1;
      uint64_t RDET6:1;
      uint64_t RDET7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RISE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDET0:1;
      uint64_t FDET1:1;
      uint64_t FDET2:1;
      uint64_t FDET3:1;
      uint64_t FDET4:1;
      uint64_t FDET5:1;
      uint64_t FDET6:1;
      uint64_t FDET7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FALL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSTAT0:1;
      uint64_t PSTAT1:1;
      uint64_t PSTAT2:1;
      uint64_t PSTAT3:1;
      uint64_t PSTAT4:1;
      uint64_t PSTAT5:1;
      uint64_t PSTAT6:1;
      uint64_t PSTAT7:1;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IST;

