iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM0:1;
      uint64_t EM1:1;
      uint64_t EM2:1;
      uint64_t EM3:1;
      uint64_t EMC0:2;
      uint64_t EMC1:2;
      uint64_t EMC2:2;
      uint64_t EMC3:2;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  uint8_t res1[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTM:2;
      uint64_t CIS:2;
      uint64_t ENCC:1;
      uint64_t SELCC:3;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWMEN0:1;
      uint64_t PWMEN1:1;
      uint64_t PWMEN2:1;
      uint64_t PWMEN3:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMC;

};

#define CT32B0_2 (*(volatile struct CT32B0_2_tag *) 0x40014000)

struct ADC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:8;
      uint64_t CLKDIV:8;
      uint64_t BURST:1;
      uint64_t CLKS:3;
      uint64_t RESERVED_0:4;
      uint64_t START:3;
      uint64_t EDGE:1;
      uint64_t RESERVED_1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:8;
      uint64_t CHN:3;
      uint64_t RESERVED_2:3;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GDR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADINTENn:8;
      uint64_t ADGINTEN:1;
      uint64_t RESERVED:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:6;
      uint64_t V_VREF:10;
      uint64_t RESERVED_1:14;
      uint64_t OVERRUN:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DONE:8;
      uint64_t OVERRUN:8;
      uint64_t ADINT:1;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define ADC_2 (*(volatile struct ADC_2_tag *) 0x4001c000)

struct FLASHCTRL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASHTIM:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHCFG;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:17;
      uint64_t RESERVED:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP:17;
      uint64_t SIG_START:1;
      uint64_t RESERVED:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSSTOP;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW0_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW1_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW2_95_64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW3_127_96:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSW3;

  uint8_t res2[4004];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t SIG_DONE:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESERVED_0:2;
      uint64_t SIG_DONE_CLR:1;
      uint64_t RESERVED_1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMSTATCLR;

};

#define FLASHCTRL_2 (*(volatile struct FLASHCTRL_2_tag *) 0x4003c010)

struct SPI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSS:4;
      uint64_t FRF:2;
      uint64_t CPOL:1;
      uint64_t CPHA:1;
      uint64_t SCR:8;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBM:1;
      uint64_t SSE:1;
      uint64_t MS:1;
      uint64_t SOD:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t RESERVED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFE:1;
      uint64_t TNF:1;
      uint64_t RNE:1;
      uint64_t RFF:1;
      uint64_t BSY:1;
      uint64_t RESERVED:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPSDVSR:8;
      uint64_t RESERVED:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIM:1;
      uint64_t RTIM:1;
      uint64_t RXIM:1;
      uint64_t TXIM:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORRIS:1;
      uint64_t RTRIS:1;
      uint64_t RXRIS:1;
      uint64_t TXRIS:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORMIS:1;
      uint64_t RTMIS:1;
      uint64_t RXMIS:1;
      uint64_t TXMIS:1;
      uint64_t RESERVED:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RORIC:1;
      uint64_t RTIC:1;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

