iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
};

#define SPI0 (*(volatile struct SPI0_tag *) 0x40040000)

struct IOCON_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_6;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_RESET_PIO0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSEL1LOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_SSEL1_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t reservedSpace0:5;
      uint64_t I2CMODE:2;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t reservedSpace0:5;
      uint64_t I2CMODE:2;
      uint64_t RESERVED:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO3_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO3_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO0_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_SWCLK_PIO0_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_R_PIO0_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_R_PIO1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_R_PIO1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_R_PIO1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO3_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO2_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_SWDIO_PIO1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:1;
      uint64_t ADMODE:1;
      uint64_t RESERVED_1:2;
      uint64_t OD:1;
      uint64_t RESERVED_2:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO1_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FUNC:3;
      uint64_t MODE:2;
      uint64_t HYS:1;
      uint64_t RESERVED_0:4;
      uint64_t OD:1;
      uint64_t RESERVED_1:21;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_PIO3_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCKLOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_SCK0_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSRLOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_DSR_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDLOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_DCD_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RILOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_RI_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT16B0_CAP0LOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_CT16B0_CAP0_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCK1LOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_SCK1_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISO1LOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_MISO1_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSI1LOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_MOSI1_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CT32B0_CAP0LOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_CT32B0_CAP0_LOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDLOC:2;
      uint64_t RESERVED:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCON_RXD_LOC;

