iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/LPC11xx/emptyTargetInit/CortexM0_LPC11xx_sfr.h
};

#define GPIO0 (*(volatile struct GPIO0_tag *) 0x50003ffc)

struct GPIO1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:1;
      uint64_t DATA1:1;
      uint64_t DATA2:1;
      uint64_t DATA3:1;
      uint64_t DATA4:1;
      uint64_t DATA5:1;
      uint64_t DATA6:1;
      uint64_t DATA7:1;
      uint64_t DATA8:1;
      uint64_t DATA9:1;
      uint64_t DATA10:1;
      uint64_t DATA11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  uint8_t res0[16384];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0:1;
      uint64_t IO1:1;
      uint64_t IO2:1;
      uint64_t IO3:1;
      uint64_t IO4:1;
      uint64_t IO5:1;
      uint64_t IO6:1;
      uint64_t IO7:1;
      uint64_t IO8:1;
      uint64_t IO9:1;
      uint64_t IO10:1;
      uint64_t IO11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISENSE0:1;
      uint64_t ISENSE1:1;
      uint64_t ISENSE2:1;
      uint64_t ISENSE3:1;
      uint64_t ISENSE4:1;
      uint64_t ISENSE5:1;
      uint64_t ISENSE6:1;
      uint64_t ISENSE7:1;
      uint64_t ISENSE8:1;
      uint64_t ISENSE9:1;
      uint64_t ISENSE10:1;
      uint64_t ISENSE11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBE0:1;
      uint64_t IBE1:1;
      uint64_t IBE2:1;
      uint64_t IBE3:1;
      uint64_t IBE4:1;
      uint64_t IBE5:1;
      uint64_t IBE6:1;
      uint64_t IBE7:1;
      uint64_t IBE8:1;
      uint64_t IBE9:1;
      uint64_t IBE10:1;
      uint64_t IBE11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IBE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEV0:1;
      uint64_t IEV1:1;
      uint64_t IEV2:1;
      uint64_t IEV3:1;
      uint64_t IEV4:1;
      uint64_t IEV5:1;
      uint64_t IEV6:1;
      uint64_t IEV7:1;
      uint64_t IEV8:1;
      uint64_t IEV9:1;
      uint64_t IEV10:1;
      uint64_t IEV11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAWST0:1;
      uint64_t RAWST1:1;
      uint64_t RAWST2:1;
      uint64_t RAWST3:1;
      uint64_t RAWST4:1;
      uint64_t RAWST5:1;
      uint64_t RAWST6:1;
      uint64_t RAWST7:1;
      uint64_t RAWST8:1;
      uint64_t RAWST9:1;
      uint64_t RAWST10:1;
      uint64_t RAWST11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR0:1;
      uint64_t CLR1:1;
      uint64_t CLR2:1;
      uint64_t CLR3:1;
      uint64_t CLR4:1;
      uint64_t CLR5:1;
      uint64_t CLR6:1;
      uint64_t CLR7:1;
      uint64_t CLR8:1;
      uint64_t CLR9:1;
      uint64_t CLR10:1;
      uint64_t CLR11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IC;

};

#define GPIO1 (*(volatile struct GPIO1_tag *) 0x50013ffc)

struct GPIO2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:1;
      uint64_t DATA1:1;
      uint64_t DATA2:1;
      uint64_t DATA3:1;
      uint64_t DATA4:1;
      uint64_t DATA5:1;
      uint64_t DATA6:1;
      uint64_t DATA7:1;
      uint64_t DATA8:1;
      uint64_t DATA9:1;
      uint64_t DATA10:1;
      uint64_t DATA11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  uint8_t res0[16384];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0:1;
      uint64_t IO1:1;
      uint64_t IO2:1;
      uint64_t IO3:1;
      uint64_t IO4:1;
      uint64_t IO5:1;
      uint64_t IO6:1;
      uint64_t IO7:1;
      uint64_t IO8:1;
      uint64_t IO9:1;
      uint64_t IO10:1;
      uint64_t IO11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISENSE0:1;
      uint64_t ISENSE1:1;
      uint64_t ISENSE2:1;
      uint64_t ISENSE3:1;
      uint64_t ISENSE4:1;
      uint64_t ISENSE5:1;
      uint64_t ISENSE6:1;
      uint64_t ISENSE7:1;
      uint64_t ISENSE8:1;
      uint64_t ISENSE9:1;
      uint64_t ISENSE10:1;
      uint64_t ISENSE11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBE0:1;
      uint64_t IBE1:1;
      uint64_t IBE2:1;
      uint64_t IBE3:1;
      uint64_t IBE4:1;
      uint64_t IBE5:1;
      uint64_t IBE6:1;
      uint64_t IBE7:1;
      uint64_t IBE8:1;
      uint64_t IBE9:1;
      uint64_t IBE10:1;
      uint64_t IBE11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IBE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IEV0:1;
      uint64_t IEV1:1;
      uint64_t IEV2:1;
      uint64_t IEV3:1;
      uint64_t IEV4:1;
      uint64_t IEV5:1;
      uint64_t IEV6:1;
      uint64_t IEV7:1;
      uint64_t IEV8:1;
      uint64_t IEV9:1;
      uint64_t IEV10:1;
      uint64_t IEV11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAWST0:1;
      uint64_t RAWST1:1;
      uint64_t RAWST2:1;
      uint64_t RAWST3:1;
      uint64_t RAWST4:1;
      uint64_t RAWST5:1;
      uint64_t RAWST6:1;
      uint64_t RAWST7:1;
      uint64_t RAWST8:1;
      uint64_t RAWST9:1;
      uint64_t RAWST10:1;
      uint64_t RAWST11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK0:1;
      uint64_t MASK1:1;
      uint64_t MASK2:1;
      uint64_t MASK3:1;
      uint64_t MASK4:1;
      uint64_t MASK5:1;
      uint64_t MASK6:1;
      uint64_t MASK7:1;
      uint64_t MASK8:1;
      uint64_t MASK9:1;
      uint64_t MASK10:1;
      uint64_t MASK11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR0:1;
      uint64_t CLR1:1;
      uint64_t CLR2:1;
      uint64_t CLR3:1;
      uint64_t CLR4:1;
      uint64_t CLR5:1;
      uint64_t CLR6:1;
      uint64_t CLR7:1;
      uint64_t CLR8:1;
      uint64_t CLR9:1;
      uint64_t CLR10:1;
      uint64_t CLR11:1;
      uint64_t RESERVED:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IC;

